import re
'''
Створити регулярний вираз, що буде перевіряти, чи правильно записана конструкція besin-writeln()-end. У цій послідовності
слід дотримуватися наступних правил: всередині begin може розташовуватись максимум ще одна кострукція, що починається з
begin. Очевидно, що кількість слів end має бути аналогічною. При цьому кількість вкладень writeln() не обмежуэться. Весь
вираз записується без використання пробільних символів
'''

def res_func(str_1):
    """checking the input string"""
    if bool(re.match('^[begin ]{1,2}[writeln() ]+[end]{1,2}$', str_1)):
        print('YES')
    else:
        print('NO')


in_string = input('Введіть рядок: ')

res_func(in_string)